### Functions
1. Discount List
2. Too good to go
3.

In [111]:
import pandas as pd
warehouse = pd.read_csv('warehouse.csv')
warehouse.sample(5)

    product_id          product_name  ... discount  discount_due_date
15      789012             Rye Bread  ...      NaN                NaN
2       234567     Whole Wheat Bread  ...      NaN                NaN
58      123463                 Mango  ...      0.2         2024-10-01
70      876543        Sourdough Loaf  ...      NaN                NaN
7       891011  Grass-fed Beef Steak  ...      NaN                NaN

[5 rows x 6 columns]

In [113]:
purchase_history = pd.read_csv('purchase_history.csv')
purchase_history.sample(5)

    product_id  user_id  ... quantity  total_paid
15      789012        2  ...        4       12.00
71      123463        5  ...        4        8.80
54      123465        3  ...        1        1.80
53      345678        5  ...        2        6.75
61      456789        4  ...        1        5.00

[5 rows x 7 columns]